synth -auto-top -lut 4 -run :fine
stat -width
opt -full
memory_bram -rules bram.rules
memory_map
opt -full
read_verilog -lib cells_sim.v
techmap -map alu_map.v
techmap 
techmap -map dff_map.v
techmap
opt -fast
abc -luts 1,1,1,1,3,6  -dress
opt -fast
techmap -map lut_map.v
stat -width
